#language:ru
#noinspection NonAsciiCharacters

Функционал: Возможность удаления сообщений в чате
  Для того, чтобы пользоваться приложением now-i-am
  Как обычный пользователь
  Я должен иметь возможность удалить сообщения

  @delete-messages
  Сценарий: Удаление сообщений
    Допустим  я нахожусь на странице "Логин"
#    Если я ввожу в поля формы:
#      | Почтовый адрес | caitlyn@gmail.com |
#      | Пароль         | 123               |
#    И нажимаю на кнопку формы "Войти"
#    То я должен увидеть текст "Вход успешно выполнен!"
#    Допустим я кликаю на иконку со стилями "#sms-icon"
#    Допустим я вижу текст "James" со стилями ".chat-list-content__name"
#    Допустим я кликаю на иконку со стилями ".chat-list-content__info_desktop"
#    Допустим я жду "10" секунд
#    Допустим я кликаю на иконку со стилями ".chat-room-header__trigger-icon"
#    Допустим я кликаю на текст "Удалить чат"
#    То я должен увидеть текст "Вы точно хотите удалить чат?"
#    Допустим я кликаю на иконку со стилями ".delete-messages-btn"
#    То я не должен видеть текст со стилями ".message"





