#language:ru
#noinspection NonAsciiCharacters

Функционал: Регистрация пользователя
  Для того, чтобы пользоваться приложением now-i-am
  Как обычный пользователь
  Я должен иметь возможность зарегистрироваться

  @register
  Сценарий: Регистрация
    Допустим я нахожусь на странице "Регистрация"
    Если я ввожу в поля формы:
      | Имя            | James           |
      | Почтовый адрес | james@gmail.com |
      | Пароль         | 123             |
    И нажимаю на кнопку на кнопку формы "Зарегистрироваться"
    То я должен увидеть текст "Вы успешно зарегистрировались!"
